[Killed] ArrowFunction
src/components/PokemonButtonsPanel.js:12:21
     return (
       <div className="pokedex-buttons-panel">
         <Button
-          onClick={ () => filterPokemon('all') }
+          onClick={ () => undefined }
           className="filter-button"
         >
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js

  Testa o componente <Pokedex.js />

[Killed] ArrowFunction
src/components/PokemonButtonsPanel.js:17:27
         >
           All
         </Button>
-        {pokemonTypes.map((type) => (
-          <Button
-            dataTestId={`pokemon-type-button`}
-            key={ type }
-            onClick={ () => filterPokemon(type) }
-            className="filter-button"
-          >
-            {`${type}`}
-          </Button>
-        ))}
+        {pokemonTypes.map(() => undefined)}
       </div>
     );
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js

  Testa o componente <Pokedex.js />

[Killed] ArrowFunction
src/components/PokemonButtonsPanel.js:21:23
           <Button
             dataTestId={`pokemon-type-button`}
             key={ type }
-            onClick={ () => filterPokemon(type) }
+            onClick={ () => undefined }
             className="filter-button"
           >
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js
  Testa o componente <Pokedex.js />
    ✓ Verifica se a página contém um heading h2 com o texto Encountered Pokémon (257 ms)
    ✓ Verifica se é exibido o próximo Pokémon da lista quando o botão Próximo Pokémon é clicado (819 ms)

[Survived] StringLiteral
src/components/PokemonButtonsPanel.js:24:14
             onClick={ () => filterPokemon(type) }
             className="filter-button"
           >
-            {`${type}`}
+            {``}
           </Button>
         ))}
