[Killed] ArrowFunction
src/pages/Pokedex.js:24:19
   }
 
   nextPokemon(numberOfPokemon) {
-    this.setState((state) => (
-      { pokemonIndex: (state.pokemonIndex + 1) % numberOfPokemon }
-    ));
+    this.setState(() => undefined);
   }
 
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js
  Testa o componente <Pokedex.js />
    ✓ Verifica se a página contém um heading h2 com o texto Encountered Pokémon (447 ms)
    ✕ Verifica se é exibido o próximo Pokémon da lista quando o botão Próximo Pokémon é clicado (355 ms)

[Killed] MethodExpression
src/pages/Pokedex.js:33:12
     const { pokemonList } = this.props;
     const { filteredType } = this.state;
 
-    return pokemonList.filter((pokemon) => {
-      if (filteredType === 'all') return true;
-      return pokemon.type === filteredType;
-    });
+    return pokemonList;
   }
 
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js

  Testa o componente <Pokedex.js />

[Killed] ArrowFunction
src/pages/Pokedex.js:42:43
   fetchPokemonTypes() {
     const { pokemonList } = this.props;
 
-    return [...new Set(pokemonList.reduce((types, { type }) => [...types, type], []))];
+    return [...new Set(pokemonList.reduce(() => undefined, []))];
   }
 
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js

  Testa o componente <Pokedex.js />

[Killed] StringLiteral
src/pages/Pokedex.js:54:14
 
     return (
       <div className="pokedex">
-        <h2>{`Encountered Pokémon`}</h2>
+        <h2>{``}</h2>
         <Pokemon
           pokemon={ pokemon }
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js

  Testa o componente <Pokedex.js />

[Killed] ArrowFunction
src/pages/Pokedex.js:61:27
         />
         <PokemonButtonsPanel
           pokemonTypes={ pokemonTypes }
-          filterPokemon={ (type) => this.filterPokemon(type) }
+          filterPokemon={ () => undefined }
         />
         <Button
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js

  Testa o componente <Pokedex.js />

[Killed] ArrowFunction
src/pages/Pokedex.js:66:21
         <Button
           dataTestId="next-pokemon"
           className="pokedex-button"
-          onClick={ () => this.nextPokemon(filteredPokemon.length) }
+          onClick={ () => undefined }
           disabled={ filteredPokemon.length <= 1 }
         >
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test src/tests/Pokedex.test.js


FAIL src/tests/Pokedex.test.js

  Testa o componente <Pokedex.js />
